# SQL in Python

### Information we need to connect to a (remote) database

- ip address or hostname
- user name
- port number
- password
- DB name

> postgres://username:password@hostname/DBname

### Hiding credentials in your python scripts

1. place a file `.env` in your project folder
2. make sure that `.env` is listed in your `.gitignore`  (you don't want to upload that to GitHub!)
3. write credentials inside the `.env`: `SQL_ALCHEMY_DATABASE_URI='postgres://postgres:postgres@localhost/spiced'`
4. inside python script or notebook load the environment variables

In [1]:
import os
from dotenv import load_dotenv
# read's in the .env file and sets the environment variables that it contains
# make sure that .env is in your .gitignore!
load_dotenv()

True

In [2]:
# reading environment variables
os.getenv('SQL_ALCHEMY_DATABASE_URI')

'postgres://postgres:postgres@database-sumac.cb2uvvagpupx.eu-central-1.rds.amazonaws.com/spiced'

In [4]:
os.getenv('SQL_ALCHEMY_DATABASE_URI_northwind')

'postgres://marcel:Rakoluk82@database-marcel-sumac.c7q7fatxfpdo.eu-central-1.rds.amazonaws.com/northwind'

In [3]:
# uri = 'postgres://<user>:<password>@<hostname>/<db-name>'
# uri = 'postgres://postgres:postgres@localhost/spiced'
uri = os.getenv('SQL_ALCHEMY_DATABASE_URI_northwind')

In [5]:

uri

'postgres://marcel:Rakoluk82@database-marcel-sumac.c7q7fatxfpdo.eu-central-1.rds.amazonaws.com/northwind'

### Create an engine

The engine takes care of opening (and closing) connections to the database

In [6]:
from sqlalchemy import create_engine

In [7]:
# defines DB connection

engine = create_engine(uri, echo=False)

In [15]:
# write SQL query

query = '''

CREATE VIEW employee_orders AS
SELECT employees.lastName, employees.firstName, orders.customerID, orders.orderID
FROM employees 
FULL JOIN orders 
ON employees.employeeID = orders.employeeID;

CREATE VIEW emp_ord_odet AS
SELECT employee_orders.lastName, employee_orders.firstName, employee_orders.customerID, order_details.productID, order_details.unitPrice, order_details.quantity, order_details.discount
FROM employee_orders
FULL JOIN order_details 
ON employee_orders.orderID = order_details.orderID;

CREATE VIEW emp_product AS
SELECT emp_ord_odet.lastName, emp_ord_odet.firstName, emp_ord_odet.customerID,products.productName, emp_ord_odet.unitPrice, emp_ord_odet.quantity, emp_ord_odet.discount 
FROM emp_ord_odet
FULL JOIN products
ON emp_ord_odet.productID = products.productID;'''

In [16]:
# pythonic way to access the data using a connection

with engine.connect() as conn:
    result = conn.execute(query)
result.fetchall()

ProgrammingError: (psycopg2.errors.DuplicateTable) relation "employee_orders" already exists

[SQL:

CREATE VIEW employee_orders AS
SELECT employees.lastName, employees.firstName, orders.customerID, orders.orderID
FROM employees
FULL JOIN orders
ON employees.employeeID = orders.employeeID;

CREATE VIEW emp_ord_odet AS
SELECT employee_orders.lastName, employee_orders.firstName, employee_orders.customerID, order_details.productID, order_details.unitPrice, order_details.quantity, order_details.discount
FROM employee_orders
FULL JOIN order_details
ON employee_orders.orderID = order_details.orderID;

CREATE VIEW emp_product AS
SELECT emp_ord_odet.lastName, emp_ord_odet.firstName, emp_ord_odet.customerID,products.productName, emp_ord_odet.unitPrice, emp_ord_odet.quantity, emp_ord_odet.discount
FROM emp_ord_odet
FULL JOIN products
ON emp_ord_odet.productID = products.productID;]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [10]:
# brutforce way to see the query

list(engine.execute(query))

[('Chang', 17, 40),
 ('Aniseed Syrup', 13, 70),
 ('Queso Cabrales', 22, 30),
 ("Sir Rodney's Scones", 3, 40),
 ('Gorgonzola Telino', 0, 70),
 ('Mascarpone Fabioli', 9, 40),
 ('Gravad lax', 11, 50),
 ('Rogede sild', 5, 70),
 ('Chocolade', 15, 70),
 ('Maxilaku', 10, 60),
 ('Wimmers gute Semmelknödel', 22, 80),
 ('Louisiana Hot Spiced Okra', 4, 100),
 ('Scottish Longbreads', 6, 10),
 ('Longlife Tofu', 4, 20)]

In [21]:
# lets add a column to the table in the DB

query_alter = '''
                ALTER TABLE people
                ADD COLUMN plays_instrument BOOL'''

In [ ]:
# adding a column has no data to return

with engine.connect() as conn:
    result = conn.execute(query_alter)

In [24]:
# let's check if the column wa created

query_columns = '''SELECT column_name, data_type
                   FROM Information_schema.columns
                   WHERE TABLE_NAME = 'people'
                   '''

In [25]:
# brutforce haha!

list(engine.execute(query_columns))

[('name', 'character varying'),
 ('user_id', 'integer'),
 ('location_id', 'integer'),
 ('district', 'character varying'),
 ('role', 'character varying'),
 ('height', 'integer'),
 ('plays_instrument', 'boolean')]

In [26]:
# check data, new dolumn with NONE data. We need to add the data!

list(engine.execute(query))

[('samuel', 1, 1, 'nippes', 'teacher', 180, None),
 ('marcel', 2, 2, 'altona', 'student', 170, None),
 ('raja', 3, 2, 'hammerbrook', 'student', 179, None),
 ('meerim', 4, 2, 'dulsburg', 'student', 163, None),
 ('pierre', 5, 2, 'langhorn', 'student', 193, None),
 ('gabriel', 6, 2, 'barmbek', 'student', 175, None),
 ('saad', 7, 2, 'hauptbahnhof', 'student', 168, None),
 ('arjun', 8, 3, 'rostock', 'student', 168, None),
 ('torsten', 9, 4, 'hafen', 'student', 184, None)]

### Using Pandas and SQL
- read_sql to read from a database
- to_sql to send data to a database

In [27]:
import pandas as pd

In [28]:
# read in from local .csv file
# locally we add the 1s and 0s to the plays_instrument column to the .csv file

df = pd.read_csv('./data/spiced.csv')
df

,name,user_id,location_id,district,role,height,plays_instrument
0,samuel,1,1,nippes,teacher,180,1
1,marcel,2,2,altona,student,170,1
2,raja,3,2,hammerbrook,student,179,1
3,meerim,4,2,dulsburg,student,163,0
4,pierre,5,2,langhorn,student,193,0
5,gabriel,6,2,barmbek,student,175,0
6,saad,7,2,hauptbahnhof,student,168,0
7,arjun,8,3,rostock,student,168,1
8,torsten,9,4,hafen,student,184,0

In [29]:
# must change to bool since the table in the DB has the datatype set as bool!

df['plays_instrument']=df['plays_instrument'].astype('bool')
df.head()

,name,user_id,location_id,district,role,height,plays_instrument
0,samuel,1,1,nippes,teacher,180,True
1,marcel,2,2,altona,student,170,True
2,raja,3,2,hammerbrook,student,179,True
3,meerim,4,2,dulsburg,student,163,False
4,pierre,5,2,langhorn,student,193,False

In [30]:
# sends data to database
# datatypes and constraints will be set by default unless you have already made the table in postgres
# or send the datatypes with as a parameter in .to_sql

df.to_sql('people', engine, if_exists='replace', index=False)

In [31]:
list(engine.execute(query))

[('samuel', 1, 1, 'nippes', 'teacher', 180, True),
 ('marcel', 2, 2, 'altona', 'student', 170, True),
 ('raja', 3, 2, 'hammerbrook', 'student', 179, True),
 ('meerim', 4, 2, 'dulsburg', 'student', 163, False),
 ('pierre', 5, 2, 'langhorn', 'student', 193, False),
 ('gabriel', 6, 2, 'barmbek', 'student', 175, False),
 ('saad', 7, 2, 'hauptbahnhof', 'student', 168, False),
 ('arjun', 8, 3, 'rostock', 'student', 168, True),
 ('torsten', 9, 4, 'hafen', 'student', 184, False)]

In [32]:
# reads from database into pandas

pd.read_sql(query, engine)

,name,user_id,location_id,district,role,height,plays_instrument
0,samuel,1,1,nippes,teacher,180,True
1,marcel,2,2,altona,student,170,True
2,raja,3,2,hammerbrook,student,179,True
3,meerim,4,2,dulsburg,student,163,False
4,pierre,5,2,langhorn,student,193,False
5,gabriel,6,2,barmbek,student,175,False
6,saad,7,2,hauptbahnhof,student,168,False
7,arjun,8,3,rostock,student,168,True
8,torsten,9,4,hafen,student,184,False